In [2]:
import pandas as pd
import numpy as np

In [12]:
 test_df=pd.read_csv('Test1.csv',sep=';')

In [13]:
test_df.head()

  Unnamed: 0  Column1  Column2  Column3  Column4
0       Row1        0        1        2        3
1       Row2        4        5        6        7
2       Row3        8        9       10       11
3       Row4       12       13       14       15
4       Row5       16       17       18       19

In [4]:
df=pd.read_csv('pokemon_data.csv')

In [5]:
df.head()

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False

In [8]:
## df.info  inbuild function used to see the info how many colunm and rows are there

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #           800 non-null    int64
 1   Name        800 non-null    object
 2   Type 1      800 non-null    object
 3   Type 2      414 non-null    object
 4   HP          800 non-null    int64
 5   Attack      800 non-null    int64
 6   Defense     800 non-null    int64
 7   Sp. Atk     800 non-null    int64
 8   Sp. Def     800 non-null    int64
 9   Speed       800 non-null    int64
 10  Generation  800 non-null    int64
 11  Legendary   800 non-null    bool
dtypes: bool(1), int64(8), object(3)
memory usage: 69.7+ KB

In [9]:
df.describe()

,#,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation
count,800.000000,800.000000,800.000000,800.000000,800.000000,800.000000,800.000000,800.00000
mean,362.813750,69.258750,79.001250,73.842500,72.820000,71.902500,68.277500,3.32375
std,208.343798,25.534669,32.457366,31.183501,32.722294,27.828916,29.060474,1.66129
min,1.000000,1.000000,5.000000,5.000000,10.000000,20.000000,5.000000,1.00000
25%,184.750000,50.000000,55.000000,50.000000,49.750000,50.000000,45.000000,2.00000
50%,364.500000,65.000000,75.000000,70.000000,65.000000,70.000000,65.000000,3.00000
75%,539.250000,80.000000,100.000000,90.000000,95.000000,90.000000,90.000000,5.00000
max,721.000000,255.000000,190.000000,230.000000,194.000000,230.000000,180.000000,6.00000

# CSV

In [14]:
from io import StringIO,BytesIO

In [15]:
data = ('col1,col2,col3\n'
              'x,y,1\n'
               'a,b,2\n'
                'c,d,3')

In [16]:
type(data)

str

In [18]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [19]:
 ## read from specific columns

In [21]:
df=pd.read_csv(StringIO(data),usecols=['col1','col3'])

In [22]:
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [23]:
df.to_csv('Test.csv')

In [25]:
## specify columns data types

In [32]:
 
    
    data=('a,b,c,d\n'
             '1,2,3,4\n'
              '5,6,7,8\n'
              '9,10,11,12')

In [33]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [34]:
df=pd.read_csv(StringIO(data),dtype=object)

In [35]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [36]:
df['a'][1]

'5'

In [39]:
df=pd.read_csv(StringIO(data),dtype={'b':int,'c':float,'a':'int64'})

In [40]:
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [41]:
df['a'][1]

5

In [42]:
# check the data type

In [44]:
df.dtypes

a      int64
b      int32
c    float64
d      int64
dtype: object